In [1]:
import pandas as pd
import numpy as np
import os
from os.path import join

In [2]:
path = '../Data'

In [3]:
df_opr = pd.read_csv(join(path, 'Clean Data', 'clean_order_products_prior.csv'))

In [4]:
df_opr.head()

   Unnamed: 0  order_id  product_id  reordered
0           0         2       33120          1
1           1         2       28985          1
2           2         2        9327          0
3           3         2       45918          1
4           4         2       30035          0

In [5]:
# dropping Unnammed:0 column
df_opr = df_opr.drop(columns = ['Unnamed: 0'])

In [6]:
df_opr.head()

   order_id  product_id  reordered
0         2       33120          1
1         2       28985          1
2         2        9327          0
3         2       45918          1
4         2       30035          0

In [7]:
df_ord = pd.read_csv(join(path, 'Clean Data', 'orders_clean'))

In [8]:
df_ord.head()

,Unnamed: 0,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,11.0
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [9]:
# dropping Unnammed: 0 column
df_ord = df_ord.drop(columns = ['Unnamed: 0'])

In [10]:
df_ord.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,11.0
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [11]:
df_opr.shape

(32434489, 3)

In [12]:
df_ord.shape

(3421083, 6)

In [13]:
# merging orders and order products prior together
df_merg = df_ord.merge(df_opr, on = 'order_id', how = 'inner', indicator = True)

In [14]:
df_merg.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,reordered,_merge
0,2539329,1,1,2,8,11.0,196,0,both
1,2539329,1,1,2,8,11.0,14084,0,both
2,2539329,1,1,2,8,11.0,12427,0,both
3,2539329,1,1,2,8,11.0,26088,0,both
4,2539329,1,1,2,8,11.0,26405,0,both

In [15]:
# checking merge results
value_counts = df_merg['_merge'].value_counts()
print(value_counts)

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

In [16]:
# checking for missing values
missing_values = df_merg.isnull().sum()
print(missing_values)

order_id                  0
user_id                   0
order_number              0
order_dow                 0
order_hour_of_day         0
days_since_prior_order    0
product_id                0
reordered                 0
_merge                    0
dtype: int64

In [17]:
# deleting merge column
df_merg = df_merg.drop(columns = ['_merge'])

In [18]:
del df_ord

In [19]:
del df_opr

In [20]:
# Checking for duplicate values
duplicate_rows = df_merg[df_merg.duplicated()]
if duplicate_rows.shape[0]==0:
    print('No Duplicates Found')
else:
    print(duplicate_rows.head())

No Duplicates Found

In [21]:
df_merg.head()

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,reordered
0,2539329,1,1,2,8,11.0,196,0
1,2539329,1,1,2,8,11.0,14084,0
2,2539329,1,1,2,8,11.0,12427,0
3,2539329,1,1,2,8,11.0,26088,0
4,2539329,1,1,2,8,11.0,26405,0

In [22]:
# saving merged dataset
import pickle
df_merg.to_pickle(join(path, 'Clean Data', 'orders_products_prior_merge.pkl'))